Revit 2027 API
TextNoteOptions.Rotation Property
 Base line angle of a text note, in radians.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Rotation { get; set; }
Public Property Rotation As Double
	Get
	Set
public:
property double Rotation {
	double get ();
	void set (double value);
}
member Rotation : float with get, set
Property Value
Double
Remarks
 Default value is 0.0.
See Also
Reference
TextNoteOptions Class
Autodesk.Revit.DB Namespace